app/controllers/records_controller.rb

    def index
        records=Record.all
---
SELECT "records".* FROM "records"